WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  if(isFirstTime)
  {
    isFirstTime = false;

    // (--) Diag config LED
    stm32_configgpio(DEBUG_PIN_V2_D06);
    // (--) Diag LED
  }

  if(timerNumber > 14 || timerNumber < 1)
  {
    syslog(2, "%s@%d-Timer must be 1 - 14\n", __FILE__, __LINE__);
    return -ENOTSUP;
  }
  
  if(channelNumber > 4 || channelNumber < 1)
  {
    syslog(2, "%s@%d-Channel must be 1 - 4\n", __FILE__, __LINE__);
    return -ENOTSUP;
  }

  // Insure a valid timer, channel, pin+port combination was supplied.
  // Timers have, at most, 1-4 channels, each representing 1 GPIO. For the
  // specified timer we need to verify a proper port and pin.
  uint8_t chanValid4TimerPortPin = meadow_measure_freq_get_chan_tim_port_pin(
            timerNumber, portAndPin);
  if(chanValid4TimerPortPin == 0)
  {
    syslog(2, "%s@%d-The Port and Pin, not valid for timer %d\n",
              __FILE__, __LINE__, timerNumber);
    return -ENOTSUP;
  }

  // Is this the channel the user wanted?
  if(channelNumber != chanValid4TimerPortPin)
  {
    syslog(2, "%s@%d-The Port/Pin/Timer/Channel combination, not valid\n",
              __FILE__, __LINE__);
    return -ENOTSUP;
  }

  // Check if this timer is useable and get a pointer if it is
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Timer %ld cannot be used\n",
              __FILE__, __LINE__, timerNumber);
    return -ENOTSUP;
  }

  // Are any channels active? If not, timer needs to be initialized
  if(mdwFreqTimerInfo->chanActiveBits == 0)
    timerNeedsConfig = true;
  else
    timerNeedsConfig = false;

  // This timer is usable, but is this channel already being used?
  uint8_t chanBit = meadow_measure_freq_get_chan_bit_set(channelNumber);
  if(mdwFreqTimerInfo->chanActiveBits & chanBit)
  {
    syslog(LOG_ERR, "%s@%d-Timer %d, channel %d already in use\n",
              __FILE__, __LINE__, timerNumber, channelNumber);
    return -EADDRINUSE;
  }

  // Build the GPIO input configuration for Nuttx GPIO processing
  inputGpioConfig = MEADOW_TIMER_GPIO_CONST | portAndPin | \
            mdwFreqTimerInfo->timerAltFunc;

  // Diagnostic
  // syslog(1, "%s@%d-input Pin defn:0x%02x (P%c%d), Pin defn + AF:0x%08lx\n",
  //           __FILE__, __LINE__, portAndPin,
  //           ((portAndPin) >> 4) + 'A', portAndPin & 0x0f, inputGpioConfig);
  // Diagnostic

  // Allocate a struct for each new channel on a timer
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset] =
            (mdwFreqChanData_t*)zalloc(sizeof(mdwFreqChanData_t));
  if(mdwFreqTimerInfo->mdwFreqChanData[channelOffset] == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Allocation for mdwFreqChanData_s NULL\n", __FILE__, __LINE__);
    return -ENOMEM;
  }
  syslog(1, "-->%s@%d-Channel %ld allocted %p for chan data\n", __FILE__, __LINE__,
          channelNumber, mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);

  // Valid GPIO so configure input point for timer.
    // Diagnostic
  syslog(1, "-->%s@%d-TIM%lu, Chn:%lu, input Pin defn:0x%02x (P%c%d), Pin defn+AF:0x%08lx\n",
            __FILE__, __LINE__, timerNumber, channelNumber, portAndPin,
            ((portAndPin) >> 4) + 'A', portAndPin & 0x0f, inputGpioConfig);
  // Diagnostic

  // Valid GPIO so configure input for channel.
ret = stm32_configgpio(inputGpioConfig);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:stm32_configgpio() returned:%ld\n",
              __FILE__, __LINE__, ret);
    free(mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
    return -ENOTSUP;   // Not supported
  }

  if(timerNeedsConfig)
  {
    // Initialized the F7's timer hardware
    ret = meadow_measure_freq_cfg_timer_hardware(mdwFreqTimerInfo,
              chanValid4TimerPortPin, true);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Meadow frequency init failed:%d\n",
                __FILE__, __LINE__, ret);
      free(mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
      return ret;
    }
  }

  // Initialized the F7's timer hardware
  ret = meadow_measure_freq_cfg_timer_hardware(mdwFreqTimerInfo, chanValid4TimerPortPin,
            true);
  // if(timerNeedsConfig)
  // {
  //   // Initialized the F7's timer hardware
  //   ret = meadow_measure_freq_cfg_timer_hardware(mdwFreqTimerInfo);
  //   if(ret < 0)
  //   {
  //     syslog(LOG_ERR, "%s@%d-Meadow frequency init failed:%d\n",
  //               __FILE__, __LINE__, ret);
  //     free(mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
  //     return ret;
  //   }
  // }

  // // Initialized the F7's channel hardware for this GPIO input 
  // ret = meadow_measure_freq_cfg_channel_hardware(mdwFreqTimerInfo,
  //         channelNumber);
  // if(ret < 0)
  // {
  //   syslog(LOG_ERR, "%s@%d-Meadow frequency init failed:%d\n",
  //             __FILE__, __LINE__, ret);
  //   free(mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
  //   return ret;
  // }

  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Meadow frequency init failed:%d\n",
              __FILE__, __LINE__, ret);
    free(mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
    return ret;
  }

  // Start filling the channel structure
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset]->inputConfig     = inputGpioConfig;
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset]->inputTimerChan  = chanValid4TimerPortPin;
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset]->totalGpioPulses = 0;
  // And indicate in timer structure that this channel is being used
  mdwFreqTimerInfo->chanActiveBits |= chanBit;    // Set channel bit

  // The time found here, is used to calculate average frequency
  startCaptureTime = meadow_measure_freq_get_current_time();
  return OK;
}

//=============================================================
// Frequency (and duty cycle) configuration of timer registers.
int meadow_measure_freq_cfg_timer_hardware(
          mdwFreqTimerInfo_t *mdwFreqTimerInfo,
          int inputTimerChan,
          bool timerNeedsConfig)
{
  int ret;
  uint16_t regVal16;
  uint32_t regVal32;

  if(mdwFreqTimerInfo == NULL)
    return -ENXIO;

  uint32_t timerBase = mdwFreqTimerInfo->timerBase;
  
  // Before starting disable capture/control for all channels. Ref Man (26.4.7 at
  // end) "Note: CC1S bits are writable only when the channel is OFF (i.e.
  // CC1E = 0 in TIMx_CCER)."
  regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  // clear CCxE bits 0, 4, 8 & 12
  regVal16 &= ~(GTIM_CCER_CC1E | GTIM_CCER_CC2E | GTIM_CCER_CC3E | GTIM_CCER_CC4E);
  putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);

  // Associate each input to it's capture/compare register
  uint16_t dierBits = 0;
  dierBits |= GTIM_DIER_UIE;    // Enable timer overrun

  switch(inputTimerChan)
  {
    case 1:
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET);
      regVal32 |= 0x00000001;       // 1 = 01, set bits 1:0
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR1_OFFSET);

      // Set the input triggers, rising, falling or both for channel
      regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
      // regVal16 &= ~(GTIM_CCER_CC1P | GTIM_CCER_CC1NP); // 00 rising only
      regVal16 |= (GTIM_CCER_CC1P | GTIM_CCER_CC1NP);     // 11 both edges
      putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);

      dierBits |= GTIM_DIER_CC1IE;
      break;

