WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
    case 2:
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET);
      regVal32 |= 0x00000100;   // 0x0100 = 0100, set bits 9:8
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR1_OFFSET);

      regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
      // regVal16 &= ~(GTIM_CCER_CC2P | GTIM_CCER_CC2NP); // 00 rising only
      regVal16 |= (GTIM_CCER_CC2P | GTIM_CCER_CC2NP);     // 11 both edges
      putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);

      dierBits |= GTIM_DIER_CC2IE;
      break;

    case 3:
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR2_OFFSET);
      regVal32 |= 0x00000001;   // 1 = 01, set bits 1:0
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR2_OFFSET);

      regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
      // regVal16 &= ~(GTIM_CCER_CC3P | GTIM_CCER_CC3NP); // 00 rising only
      regVal16 |= (GTIM_CCER_CC3P | GTIM_CCER_CC3NP);     // 11 both edges
      putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);
      dierBits |= GTIM_DIER_CC3IE;
      break;

    case 4:
      // 01: IC4 is mapped on TI4
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR2_OFFSET);
      regVal32 |= 0x00000100;   // 0x0100 = 0100, set bits 9:8
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR2_OFFSET);

      regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
      // regVal16 &= ~(GTIM_CCER_CC4P | GTIM_CCER_CC4NP); // 00 rising only
      regVal16 |= (GTIM_CCER_CC4P | GTIM_CCER_CC4NP);     // 11 both edges
      putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);
      dierBits |= GTIM_DIER_CC4IE;
      break;

    default:
      return -ENODEV;   // No such device
  }

  // Slave mode control register
  regVal32 = getreg32(timerBase + STM32_GTIM_SMCR_OFFSET);
  regVal32 &= ~(GTIM_SMCR_ECE | GTIM_SMCR_DISAB | GTIM_SMCR_SMS);
  putreg32(regVal32, timerBase + STM32_GTIM_SMCR_OFFSET);

  // To enable the timer we needed to know which clock enable register to use.
  // And we need to know which bit to set in the register
  uint32_t apbClock = meadow_measure_freq_get_apb_clock(mdwFreqTimerInfo);
  modifyreg32(apbClock, 0, mdwFreqTimerInfo->timerClkEn);

  // (--) NEW FEATURE IMPLEMENTED HERE? ALLOW USER TO SELECT FREQUENCY VIA
  // SLOW, MEDIUM AND FAST SELECTION? BUT NOT PER CHANNEL, PER TIMER
  // ?? Find proper pre-scaler value so all timers run at the same speed, no
  // ?? matter which clock line they are connected to.
  //
  // Must be between 0 and 0xffff. Set the prescaler value of 0 to allow
  // highest speed, allowed by MEADOW_FREQ_CLOCK_FREQ.
  // A prescaler value of 1 will divide the clock by 2.
  uint16_t prescaler = (meadow_measure_freq_get_max_clock(mdwFreqTimerInfo)/ \
            MEADOW_FREQ_CLOCK_FREQ) - 1;
  putreg16(prescaler, timerBase + STM32_GTIM_PSC_OFFSET);

  // The value put into the ARR is maximum allowed for the timer. Either
  // 32-bit or 16-bit ARR register.
  uint32_t maxARRValue = mdwFreqTimerInfo->timerWidth ==
            MEADOW_FREQ_TIMER_WIDTH_16 ? 0xffff : 0xffffffff;
  putreg32(maxARRValue, timerBase + STM32_GTIM_ARR_OFFSET);

  // Control Register 1
  uint16_t regval = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  regval |= GTIM_CR1_ARPE;    // Auto Reload Pre-Load enable bit
  putreg16(regval, timerBase + STM32_GTIM_CR1_OFFSET);

  // Enable the timer input capture for this channel (it was disabled earlier)
  regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  switch(inputTimerChan)
  {
    case 1:
      regVal16 |= GTIM_CCER_CC1E;
      break;

    case 2:
      regVal16 |= GTIM_CCER_CC2E;
      break;

    case 3:
      regVal16 |= GTIM_CCER_CC3E;
      break;

    case 4:
      regVal16 |= GTIM_CCER_CC4E;
      break;
  }
  putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);

  // Clear all interrupt sources and set the ones we need in the DMA/Interrupt
  // enable register (DIER).
  // Note: Advanced timers 1 & 8 add ATIM_DIER_COMIE, ATIM_DIER_BIE and
  // ATIM_DIER_COMDE
  putreg16(dierBits, timerBase + STM32_GTIM_DIER_OFFSET);

  // All interrupts are handled by the same ISR code, but each timer has a
  // different interrupt vector.
  ret = irq_attach(mdwFreqTimerInfo->timerIrqVec,
            meadow_measure_freq_isr,  // ISR address
            mdwFreqTimerInfo);        // Argument to ISR
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-irq_attach failed, ret:%d, errno:%d\n",
          __FILE__, __LINE__, ret, errno);
    return ret;
  }

  // Enable timer
  meadow_measure_freq_enable(timerBase);

  // Lastly enable IRQ
  up_enable_irq(mdwFreqTimerInfo->timerIrqVec);

  return OK;
}

//=============================================================
// Called to unconfigure a timer
int meadow_measure_freq_unconfigure(const uint32_t timerNumber)
{
  // mdwFreqTimerInfo_t *mdwFreqTimerInfo =
  //           meadow_measure_freq_chk_get_timer_info(timerNumber);

  // // Is this slot being used?
  // if(mdwFreqTimerInfo->mdwFreqChanData == NULL)
  // {
  //   syslog(LOG_ERR, "%s@%d-Can't unconfigure, this timer %lu not configured.\n",
  //             __FILE__, __LINE__, timerNumber);
  //   return -EBADSLT;    // Invalid slot
  // }

  // // Stop interrupts
  // up_disable_irq(mdwFreqTimerInfo->timerIrqVec);

  // // Stop timer
  // meadow_measure_freq_disable(mdwFreqTimerInfo->timerBase);

  // // Unconfigure GPIO
  // stm32_unconfiggpio(mdwFreqTimerInfo->mdwFreqChanData->inputConfig);

  // // Free runtime memory
  // free(mdwFreqTimerInfo->mdwFreqChanData);
  // mdwFreqTimerInfo->mdwFreqChanData = NULL;
  return OK;
}

//================================================================
// Return Frequency and Duty Cycle information to caller.
// Moved as much processing here as apposed to the ISR.
int meadow_measure_freq_return_freq_info(mdwFreqReturnData_t
          *returnData)
{
  double dblFrequency;
  double dblAverageFreq;
  double dblDutyCycle;
  double dblTotalInputCount;
  uint64_t halfCycle;
  uint64_t fullCycle;
  uint64_t regOvrFloTimSize;
  uint64_t beginCaptrUi64;
  uint64_t midCaptrUi64;
  uint64_t endCaptrUi64;
  uint64_t endCaptureTime = meadow_measure_freq_get_current_time();

  syslog(1, "-->Returning data-for timer:%lu, channel:%lu\n",
            returnData->timerNumber, returnData->channelNumber);

  // Verify that provided timer and channel are valid
  if(returnData->timerNumber > 14 || returnData->timerNumber < 1)
  {
    syslog(2, "%s@%d-Timer must be 1 - 14\n", __FILE__, __LINE__);
    return -ENOTSUP;
  }
  
  if(returnData->channelNumber > 4 || returnData->channelNumber < 1)
  {
    syslog(2, "%s@%d-Channel must be 1 - 4\n", __FILE__, __LINE__);
    return -ENOTSUP;
  }

