WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(returnData->timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Couldn't get TimerInfo from timer number:%lu\n",
          __FILE__, __LINE__, returnData->timerNumber);
    return -1;
  }

  // Is the channel configured?
  uint8_t channelBit = meadow_measure_freq_get_chan_bit_set(returnData->channelNumber);
  if((mdwFreqTimerInfo->chanActiveBits & channelBit) == 0)
  {
    syslog(1, "%s@%d-Unconfigured channel accessed\n", __FILE__, __LINE__);
    return -ERROR;  // -1
  }

  mdwFreqChanData_t *mdwFreqChanData =
            mdwFreqTimerInfo->mdwFreqChanData[returnData->channelNumber - 1];
  if(mdwFreqChanData == NULL)
  {
    syslog(1, "%s@%d-Channel data NULL\n", __FILE__, __LINE__);
    return -ERROR;  // -1
  }

  syslog(1, "-->Returning data-Channel data is at: %p\n", mdwFreqChanData);

  // We need the timer's width to do the overflow math
  if(mdwFreqTimerInfo->timerWidth)
    regOvrFloTimSize = MEADOW_FREQ_32_BIT_OVERFLOW_COUNT;
  else
    regOvrFloTimSize = MEADOW_FREQ_16_BIT_OVERFLOW_COUNT;

  uint64_t ovrFloStartCnt = mdwFreqChanData->bgnResltOFlo;

  // (--) THE FIRST VALUE IS ALWAYS O
  // Add in the overflow counts and normalize mid and end capture counts
  beginCaptrUi64 = mdwFreqChanData->bgnResltCnt + ((mdwFreqChanData->bgnResltOFlo - ovrFloStartCnt) * regOvrFloTimSize);
  midCaptrUi64   = mdwFreqChanData->midResltCnt + ((mdwFreqChanData->midResltOFlo - ovrFloStartCnt) * regOvrFloTimSize);
  endCaptrUi64   = mdwFreqChanData->endResltCnt + ((mdwFreqChanData->endResltOFlo - ovrFloStartCnt) * regOvrFloTimSize);

  // Begin is 0, normalize the others too
  fullCycle = endCaptrUi64 - beginCaptrUi64;
  halfCycle = midCaptrUi64 - beginCaptrUi64;

  // To help preserve resolution, use floating point math.
  syslog(1, "==>%s@%d-Snapshot-full Count:%llu, half Count:%llu, inputTotal:%llu\n",
            __FILE__, __LINE__,
            fullCycle, halfCycle,
            mdwFreqChanData->totalGpioPulses);

  // Duty Cycle is the ratio of the full cycle count and the cycle count
  // before the trailing edge was detected.
  dblDutyCycle = (((double)halfCycle) * 100.0) / ((double)fullCycle);

  // The dblFrequency is the timer's clock divided by the cycle count.
  dblFrequency = ((double)MEADOW_FREQ_CLOCK_FREQ) / ((double)fullCycle);

  // Average frequency since last read calculations
  uint64_t totalCaptureTime = endCaptureTime - startCaptureTime;
  // Convert nanoseconds to fractional seconds
  double dblTotalCaptureTime = ((double) totalCaptureTime) / (1000.0 * 1000.0 * 1000.0);
  dblTotalInputCount = (double)mdwFreqChanData->totalGpioPulses;
  dblAverageFreq = ((double)dblTotalInputCount) / dblTotalCaptureTime;

  syslog(2, "==>AvgFreq:%6.2f, Since last read, GpioCnt:%llu\n",
            dblAverageFreq,
            mdwFreqChanData->totalGpioPulses);

  syslog(2, "In Code-Freq:%06.2fHz, DC:%02.2f%%, AvgFreq:%06.8f, Count:%lu\n",
            dblFrequency, dblDutyCycle, dblAverageFreq,
            (uint32_t)dblTotalInputCount);

  returnData->frequencyX1000  = (dblFrequency * 1000.0);
  returnData->dutyCycleX1000  = (dblDutyCycle * 1000.0);
  returnData->avgFreqX1000    = (dblAverageFreq * 1000.0);
  returnData->totalGpioPulses = (uint32_t)dblTotalInputCount;

  // Reset capture counts for new average calc
  mdwFreqChanData->totalGpioPulses = 0;
  startCaptureTime = meadow_measure_freq_get_current_time();

  return OK;
}
#endif    // #if defined(MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD)
